app/Controllers/AuthController.php

    public function processLogin()
{
    $request = service('request');
    $username = $request->getPost('username');
    $password = $request->getPost('password');

    $userModel = new \App\Models\UserModel();
    $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1