app/Controllers/DiscussionController.php

    public function index()
    {
        $discussionModel = new DiscussionModel();
        $meetingModel = new MeetingModel();

        $data['meetings'] = $meetingModel->findAll();
---
SELECT *
FROM `meetings`