app/Controllers/ExportController.php

SELECT *
FROM `discussions`
---
    public function index()
{
    $model = new \App\Models\DiscussionModel();
    $data['discussions'] = $model->findAll();