app/Controllers/MeetingController.php

SELECT *
FROM `meetings`
---
    public function index()
    {
        $data['meetings'] = $this->meetingModel->findAll();

SELECT *
FROM `meetings`
---
    public function getMeetings()
    {
        $meetings = $this->meetingModel->findAll();

SELECT *
FROM `meetings`
WHERE `tanggal` >= '2025-12-06 13:10:23'
AND `tanggal` <= '2025-12-07 13:10:23'
ORDER BY `tanggal` ASC
---
    public function getUpcoming()
    {
        $now = date('Y-m-d H:i:s');
        $limit = date('Y-m-d H:i:s', strtotime('+1 day'));

        $meetings = $this->meetingModel->where('tanggal >=', $now)
                                      ->where('tanggal <=', $limit)
                                      ->orderBy('tanggal', 'ASC')
                                      ->findAll();