app/Controllers/ParticipantController.php

    public function getParticipants($meetingId)
    {
        $model = new ParticipantModel();
        return $this->response->setJSON($model->where('meeting_id', $meetingId)->findAll());
---
SELECT *
FROM `participants`
WHERE `meeting_id` = '4'